In [1]:
from env import config, BASE_DIR
from sqlalchemy import create_engine, text
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
DATABASE_URL =  config('HOUSING_DATABASE_URL', None)
DATABASE_URL

'mysql://root:X6eqiq9vPMkGvwDpBIEbLgY6HlxYiGj9SS4hpVFr_bE@35.238.84.243/housing_db'

In [3]:
engine = create_engine(str(DATABASE_URL))

In [4]:
DATASET_DIR=BASE_DIR / "data"
DATASET_DIR.exists()

True

In [5]:
HOUSES_CSV= DATASET_DIR / 'housing_dataset.csv'

In [6]:
import pandas as pd
df = pd.read_csv(str(HOUSES_CSV))

In [7]:
df.head()

     saledate      MA   type  bedrooms
0  30/09/2007  441854  house         2
1  31/12/2007  441854  house         2
2  31/03/2008  441854  house         2
3  30/06/2008  441854  house         2
4  30/09/2008  451583  house         2

In [8]:
table_name ='kaggle_house_data'
df.to_sql(table_name, engine, if_exists='replace', index=False)

347

In [10]:
with engine.connect() as conn:
    results=conn.execute(text(f"SELECT * FROM {table_name} LIMIT 10"))
    print(results.all())

[('30/09/2007', 441854, 'house', 2), ('31/12/2007', 441854, 'house', 2), ('31/03/2008', 441854, 'house', 2), ('30/06/2008', 441854, 'house', 2), ('30/09/2008', 451583, 'house', 2), ('31/12/2008', 440256, 'house', 2), ('31/03/2009', 442566, 'house', 2), ('30/06/2009', 446113, 'house', 2), ('30/09/2009', 440123, 'house', 2), ('31/12/2009', 442131, 'house', 2)]